АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеПараметрыПакетов/алк_ДополнительныеПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеПараметрыПакетов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидШпона</name>
    <type>
      <types>EnumRef.алк_ВидыШпона</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>СлойДревесины</name>
    <type>
      <types>EnumRef.алк_СлойДревесины</types>
    </type>
  </resources>
  <resources>
    <name>СортированныйПакет</name>
    <comment>из какого пакета была упаковка</comment>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </resources>
  <resources>
    <name>УчастокВыпуска</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </resources>
  <resources>
    <name>Досушка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Переупаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.алк_УпаковкаНоменклатуры</types>
      <types>DocumentRef.алк_РучноеИзменениеДополнительныхПараметровПакета</types>
      <types>DocumentRef.алк_РучноеИзменениеПараметровПакета</types>
      <types>DocumentRef.алк_СборкаЗапасов</types>
      <types>DocumentRef.алк_Производство</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/ManagerModule.bsl
//Можно передать массив серийных номеров или ссылку
//Возвращает массив структур (СерийныйНомер, МассивПараметров)
Функция ПолучитьСтруктуруОстатковПакетов(СерийныеНомера, Знач Дата=Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(Дата) тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Результат = новый Массив;
	
	Запрос = новый запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	алк_ОстаткиЗапасовОстатки.Организация КАК Организация,
	|	алк_ОстаткиЗапасовОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	алк_ОстаткиЗапасовОстатки.Штабель КАК Штабель,
	|	алк_ОстаткиЗапасовОстатки.Номенклатура КАК Номенклатура,
	|	алк_ОстаткиЗапасовОстатки.Характеристика КАК Характеристика,
	|	алк_ОстаткиЗапасовОстатки.Сертификат КАК Сертификат,
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер КАК СерийныйНомер,
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ЕСТЬNULL(алк_ПараметрыХарактеристик.Объем, 0) = 0
	|			ТОГДА ВЫРАЗИТЬ(алк_ОстаткиЗапасовОстатки.КоличествоОстаток / алк_ПараметрыХарактеристик.Объем КАК ЧИСЛО(20, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСостав,
	|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск, ЗНАЧЕНИЕ(Справочник.алк_ВариантыПрипуска.ПустаяСсылка)) КАК Припуск,
	|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.БоковаяДоска, ЛОЖЬ) КАК БоковаяДоска,
	|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО, ЗНАЧЕНИЕ(Справочник.алк_КатегорияНоменклатурыПЭО.ПустаяСсылка)) КАК КатегорияПЭО,
	|	ЕСТЬNULL(алк_ДополнительныеПараметрыПакетовСрезПоследних.Габарит, ЗНАЧЕНИЕ(Перечисление.алк_ГабаритПакета.ПустаяСсылка)) КАК Габарит
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(&Дата, СерийныйНомер В (&СерийныеНомера)) КАК алк_ОстаткиЗапасовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО алк_ОстаткиЗапасовОстатки.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
	|		ПО алк_ОстаткиЗапасовОстатки.СерийныйНомер = алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер
	|
	|УПОРЯДОЧИТЬ ПО
	|	алк_ОстаткиЗапасовОстатки.СерийныйНомер.Наименование
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(КоличествоСостав)
	|ПО
	|	СерийныйНомер");
	Запрос.УстановитьПараметр("СерийныеНомера"	, СерийныеНомера);
	Запрос.УстановитьПараметр("Дата"			, Новый Граница(Дата, ВидГраницы.Включая));
	ГруппировкаПоСН = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ГруппировкаПоСН.Следующий() Цикл
		
		МассивПараметров = Новый Массив;
		ДетальныеЗаписи = ГруппировкаПоСН.Выбрать();
		Пока ДетальныеЗаписи.Следующий() Цикл
			СтруктураПараметров = новый структура("Организация,СтруктурнаяЕдиница,Штабель,Номенклатура,Характеристика,Припуск,КатегорияПЭО,Габарит,Сертификат,СерийныйНомер,Количество,КоличествоСостав");
			ЗаполнитьЗначенияСвойств(СтруктураПараметров, ДетальныеЗаписи);
			МассивПараметров.Добавить(СтруктураПараметров);
		КонецЦикла;
		Результат.Добавить(Новый структура("СерийныйНомер, МассивПараметров, Количество", ГруппировкаПоСН.СерийныйНомер, МассивПараметров, ГруппировкаПоСН.Количество));
	КонецЦикла;
	
	Возврат Результат;
КонецФункции
